Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS00/svd/PIC32CM1216LS00100.svd
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>LUTCTRL[%s]</name>
               <description>LUT Control x</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>LUT Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENABLESelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>LUT block is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>LUT block is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTSEL</name>
                     <description>Filter Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>FILTSELSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Filter disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYNCH</name>
                           <description>Synchronizer enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FILTER</name>
                           <description>Filter enabled</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDGESEL</name>
                     <description>Edge Selection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EDGESELSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Edge detector is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Edge detector is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INSEL0</name>
                     <description>Input Selection 0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>INSEL0Select</name>
                        <enumeratedValue>
                           <name>MASK</name>
                           <description>Masked input</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FEEDBACK</name>
                           <description>Feedback input source</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LINK</name>
                           <description>Linked LUT input source</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVENT</name>
                           <description>Event input source</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IO</name>
                           <description>I/O pin input source</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC</name>
                           <description>AC input source</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC</name>
                           <description>TC input source</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALTTC</name>
                           <description>Alternate TC input source</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC</name>
                           <description>TCC input source</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM</name>
                           <description>SERCOM input source</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNCEVENT</name>
                           <description>Asynchronous event input source</description>
                           <value>0xB</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INSEL1</name>
                     <description>Input Selection 1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>INSEL1Select</name>
                        <enumeratedValue>
                           <name>MASK</name>
                           <description>Masked input</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FEEDBACK</name>
                           <description>Feedback input source</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LINK</name>
                           <description>Linked LUT input source</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVENT</name>
                           <description>Event input source</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IO</name>
                           <description>I/O pin input source</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC</name>
                           <description>AC input source</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC</name>
                           <description>TC input source</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALTTC</name>
                           <description>Alternate TC input source</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC</name>
                           <description>TCC input source</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM</name>
                           <description>SERCOM input source</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNCEVENT</name>
                           <description>Asynchronous event input source</description>
                           <value>0xB</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INSEL2</name>
                     <description>Input Selection 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>INSEL2Select</name>
                        <enumeratedValue>
                           <name>MASK</name>
                           <description>Masked input</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FEEDBACK</name>
                           <description>Feedback input source</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LINK</name>
                           <description>Linked LUT input source</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVENT</name>
                           <description>Event input source</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IO</name>
                           <description>I/O pin input source</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC</name>
                           <description>AC input source</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC</name>
                           <description>TC input source</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALTTC</name>
                           <description>Alternate TC input source</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC</name>
                           <description>TCC input source</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM</name>
                           <description>SERCOM input source</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNCEVENT</name>
                           <description>Asynchronous event input source</description>
                           <value>0xB</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INVEI</name>
                     <description>Inverted Event Input Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>INVEISelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Incoming event is not inverted</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVERTED</name>
                           <description>Incoming event is inverted</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LUTEI</name>
                     <description>LUT Event Input Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LUTEISelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>LUT incoming event is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>LUT incoming event is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LUTEO</name>
                     <description>LUT Event Output Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LUTEOSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>LUT event output is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>LUT event output is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRUTH</name>
                     <description>Truth Value</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
